app/views/orgs/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <select name="org[category_id]" id="org_category_id">
    <%= options_from_collection_for_select(Category.all, :id, :name) %>