app/views/orgs/index.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2 LIMIT 1
---
    <td><%= org.address %></td>
    <td><%= Category.find_by_id(org.category_id).name %></td>