app/views/orgs/show.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2 LIMIT 1
---
  <b>Category:</b>
  <%= Category.find_by_id(@org.category_id).name %>