app/controllers/orgs_controller.rb

SELECT "orgs".* FROM "orgs"
---
  def index
    @orgs = Org.all

SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = 1 LIMIT 1
---
  def show
    @org = Org.find(params[:id])

SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = 1 LIMIT 1
---
  def edit
    @org = Org.find(params[:id])

INSERT INTO "orgs" ("name", "city", "state", "zipcode", "address", "category_id", "created_at", "updated_at") VALUES ('My Foot Spa', 'San Jose', 'CA', 95129, 'De Anza Blvd', 2, '2011-06-23 00:59:19.307614', '2011-06-23 00:59:19.307614')
---
  def create
    @org = Org.new(params[:org])

    respond_to do |format|
      if @org.save

SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = 1 LIMIT 1
UPDATE "orgs" SET "primary_number" = '(408)555-5555', "primary_email" = 'twitorg1@yahoo.com', "website" = 'http://www.twitter.com/twitorg1', "notes" = 'This is a new note', "updated_at" = '2011-06-24 02:15:46.465587' WHERE "orgs"."id" = 1
---
  def update
    @org = Org.find(params[:id])

    respond_to do |format|
      if @org.update_attributes(params[:org])